charitywater/afridev2-sensor/software/firmware/AfridevV2_MSP430/src/outpour.h
/** 
 * @file outpour.h
 * \n Source File
 * \n AfridevV2 MSP430 Firmware
 * 
 * \brief MSP430 sleep control and support routines
 */

#pragma once

#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include "msp430.h"
#include "msp430g2955.h"
#include "RTC_Calendar.h"
#include "modemMsg.h"
#include "waterSense.h"


/******************************************************************************/
/** Water Detection MACROS **/

/**
 * \def NEW_PROCESSOR_IN_USE
 * For the AfridevV1 configuration always define this.
 */
#define NEW_PROCESSOR_IN_USE

/**
 * \def WATERDETECT_READ_WATER_LEVEL_NORMAL
 * Used to identify that the sensor is mounted in a well in its 
 * normal orientation.  For manufacturing testing, this should be disabled 
 * when WATER_DEBUG is defined 
 */
#ifdef WATER_DEBUG
//#define WATERDETECT_READ_WATER_LEVEL_NORMAL 1
#define READ_WATER_BETWEEN_SLEEPS 1
//#define NO_GPS_TEST 1
#define SLEEP_DEBUG 1
//#define DISPLAY_ALL_PADDATA 1
#else
#define WATERDETECT_READ_WATER_LEVEL_NORMAL 1
#define READ_WATER_BETWEEN_SLEEPS 1
#define SILENT_WATER_RESET 1
//#define SLEEP_DEBUG 1
//#define DEBUG_BATTERY_TEST 1
//#define DEBUG_SEND_SENSOR_DATA_NOW 1
#define DEBUG_DAILY_WATER_REPORTS 1
//#define RED_FLAG_TEST 1
//#define TRICKLE_VOLUME_ELIMINATE 1
//#define SEND_DEBUG_TIME_DATA 1
//#define MANUF_RESTORE_BASELINE_TARGETS
//#define MARGIN_LIMIT_CHECKS 1
#endif
/**
 * \def TICKS_PER_TREND
 * Controls how many capacitance measurements to take before 
 * running the water detection algorithm.  One capacitance 
 * measurement is taken on each iteration of the main exec loop. 
 * The main exec loop runs at a rate of (TICKS_PER_TREND / 
 * SECONDS_PER_TREND) hertz (i.e. 2 Hz). 
 */
#define TICKS_PER_TREND 4

/**
 * \def SECONDS_PER_TREND
 * Controls how often (in seconds) to execute the water 
 * detection algorithm. The storage and modem communication 
 * tasks also run at this periodic rate within the main exec 
 * loop. 
 */
#define SECONDS_PER_TREND 2

/**
 * \def SECONDS_PER_TREND_SHIFT
 * Represents the shift to perform a divide of 
 * SECONDS_PER_TREND. 
 */
#define SECONDS_PER_TREND_SHIFT 1

/**
 * \def TIMER_INTERRUPTS_PER_SECOND
 * Identifies how often the system timer interrupts per second. 
 * The main exec loop wakes up from low power mode after each 
 * timer interrupt. 
 */
#define TIMER_INTERRUPTS_PER_SECOND 2

/******************************************************************************/

/**
 * \def OUTPOUR_PRODUCT_ID
 * \brief Specify the outpour product ID number that is sent in 
 *        messages.
 */
#define AFRIDEV2_PRODUCT_ID ((uint8_t)3)

/**
 * \def FW_VERSION_MAJOR
 * \brief Specify the AfridevV2 firmware major version number.
 */
#define FW_VERSION_MAJOR ((uint8_t)0x03)

/**
 * \def FW_VERSION_MINOR
 * \brief Specify the AfridevV2 firmware minor version number. 
 *        The sign bit is set when the orientation of the sensor is inverted
 */
#define FW_MINOR 0x12
#ifndef WATERDETECT_READ_WATER_LEVEL_NORMAL
#define FW_VERSION_MINOR ((uint8_t)(FW_MINOR|0x80))
#else
#define FW_VERSION_MINOR ((uint8_t)FW_MINOR)
#endif
/**
 * \def ACTIVATE_REBOOT_KEY
 * \brief A non-zero value indicating that we need to start a 
 *        system reboot sequence.
 */
#define ACTIVATE_REBOOT_KEY 0xC3

/**
 * \def ACTIVATE_FWUPGRADE_KEY 
 * \brief A non-zero value indicating that we need to start a 
 *        firmware upgrade sequence.  This means re-booting into
 *        the boot loader.
 */
#define ACTIVATE_FWUPGRADE_KEY 0xE7

/*******************************************************************************
* System Tick Access
*******************************************************************************/

#include "waterDetect.h"

// Define the type that a system tick value is represented in
typedef uint32_t sys_tick_t;
// Just return the system tick variable value.
#define GET_SYSTEM_TICK() ((sys_tick_t)getSecondsSinceBoot());
// Return the number of elapsed seconds
#define GET_ELAPSED_TIME_IN_SEC(x) (((sys_tick_t)getSecondsSinceBoot())-(sys_tick_t)(x))

// Used for testing if running the sys tick at faster then
// the standard interval. For normal operation, must be set to 1.
#define TIME_SCALER ((uint8_t)1)

/*******************************************************************************
* MISC Macros
*******************************************************************************/

/**
 * \def TIME_5_SECONDS 
 * \brief Macro for 5 seconds
 */
#define TIME_5_SECONDS ((uint8_t)5)
/**
 * \def TIME_10_SECONDS 
 * \brief Macro for 10 seconds
 */
#define TIME_10_SECONDS ((uint8_t)10)
/**
 * \def TIME_20_SECONDS 
 * \brief Macro for 20 seconds
 */
#define TIME_20_SECONDS ((uint8_t)20)
/**
 * \def TIME_30_SECONDS 
 * \brief Macro for 30 seconds
 */
#define TIME_30_SECONDS ((uint8_t)30)
/**
 * \def TIME_60_SECONDS 
 * \brief Macro for 60 seconds
 */
#define TIME_60_SECONDS ((uint8_t)60)
/**
 * \def SECONDS_PER_MINUTE
 * \brief Macro to specify seconds per minute
 */
#define SECONDS_PER_MINUTE ((uint8_t)60)
/**
 * \def SECONDS_PER_HOUR
 * \brief Macro to specify seconds per hour
 */
#define SECONDS_PER_HOUR (SECONDS_PER_MINUTE*((uint16_t)60))
/**
 * \def TIME_ONE_HOUR
 * \brief Macro to specify one hour in terms of seconds
 */
#define TIME_ONE_HOUR SECONDS_PER_HOUR
/**
 * \def SECONDS_PER_DAY
 * \brief Macro to specify seconds per day
 */
#define SECONDS_PER_DAY ((uint32_t)86400)
/**
 * \def SEC_PER_MINUTE
 * \brief Macro to specify the number of seconds in one minute
 */
#define SEC_PER_MINUTE ((uint8_t)60)
/**
 * \def TIME_45_MINUTES
 * \brief Macro to specify the number of seconds in 45 minutes
 */
#define TIME_45_MINUTES ((uint16_t)(SEC_PER_MINUTE*(uint16_t)45))
/**
 * \def TIME_60_MINUTES
 * \brief Macro to specify the number of seconds in 60 minutes
 */
#define TIME_60_MINUTES ((uint16_t)(SEC_PER_MINUTE*(uint16_t)60))
/**
 * \def TIME_5_MINUTES
 * \brief Macro to specify the number of seconds in 5 minutes
 */
#define TIME_5_MINUTES ((uint16_t)(SEC_PER_MINUTE*(uint16_t)5))
/**
 * \def TIME_10_MINUTES
 * \brief Macro to specify the number of seconds in 10 minutes
 */
#define TIME_10_MINUTES ((uint16_t)(SEC_PER_MINUTE*(uint16_t)10))
/**
 * \def TIME_20_MINUTES
 * \brief Macro to specify the number of seconds in 10 minutes
 */
#define TIME_20_MINUTES ((uint16_t)(SEC_PER_MINUTE*(uint16_t)20))

/**
 * \typedef padId_t
 * \brief Give each pad number a name
 */
typedef enum padId_e {
    PAD0,                                                  /** 0 */
    PAD1,                                                  /** 1 */
    PAD2,                                                  /** 2 */
    PAD3,                                                  /** 3 */
    PAD4,                                                  /** 4 */
    PAD5,                                                  /** 5 */
    TOTAL_PADS = 6,                                        /** there are 6 total pads */
    MAX_PAD = PAD5,                                        /** PAD5 is the max pad value */
} padId_t;

