charitywater/afridev2-sensor/software/firmware/AfridevV2_MSP430/src/outpour.h
// Give names to the various port pin numbers
#define VBAT_GND BIT1		 // Pin 1.1, Output
#define GSM_DCDC BIT2		 // Pin 1.2, Output
#define _1V8_EN BIT3		 // Pin 1.3, Output
#define GSM_INT BIT4		 // Pin 1.4, Input
#define GSM_STATUS BIT5		 // Pin 1.5, Input
#define TM_GPS BIT6          // Pin 1.6, Input
#define GPS_ON_IND BIT7      // Pin 1.7, Input

#define VBAT_MON BIT0		 // Pin 2.0, ADC
#define I2C_DRV BIT3		 // Pin 2.3, Output
#define GSM_EN BIT4			 // Pin 2.4, Output
#define LS_VCC BIT5          // Pin 2.5, Output

#define LED_GREEN BIT1		 // Pin 3.1, Output
#define LED_RED BIT2		 // Pin 3.2, Output
#define NTC_ENABLE BIT3      // Pin 3.3, Output
#define TXD BIT4			 // Pin 3.4, UART
#define RXD BIT5			 // Pin 3.5, UART
#define MSP_UART_SEL BIT7    // Pin 3.7, UART Select (Modem or GPS)

#define GPS_ON_OFF BIT2		 // Pin 4.2, Output
#define NTC_SENSE_INPUT BIT3 // Pin 4.3, ADC

#define MODEM_UART_SELECT_ENABLE() (P3OUT &= ~MSP_UART_SEL)
#define GPS_UART_SELECT_ENABLE() (P3OUT |= MSP_UART_SEL)
#define LED_GREEN_DISABLE() (P3OUT |= LED_GREEN)
#define LED_GREEN_ENABLE() (P3OUT &= ~LED_GREEN)
#define LED_RED_DISABLE() (P3OUT |= LED_RED)
#define LED_RED_ENABLE() (P3OUT &= ~LED_RED)

/*******************************************************************************
*  Centralized method for enabling and disabling MSP430 interrupts
*******************************************************************************/
static inline void enableGlobalInterrupt(void)
{
    _BIS_SR(GIE);
}
static inline void disableGlobalInterrupt(void)
{
    _BIC_SR(GIE);
}
static inline void enableSysTimerInterrupt(void)
{
    TA1CCTL0 |= CCIE;
}
static inline void disableSysTimerInterrupt(void)
{
    TA1CCTL0 &= ~CCIE;
}
static inline void restoreSysTimerInterrupt(uint16_t val)
{
    TA1CCTL0 &= ~CCIE;                                     // clear the value
    TA1CCTL0 |= val;                                       // set to val
}
static inline uint16_t getAndDisableSysTimerInterrupt(void)
{
    volatile uint16_t current = TA1CCTL0;                  // read reg

    current &= CCIE;                                       // get current interrupt setting
    TA1CCTL0 &= ~CCIE;                                     // disable interrupt
    return (current);                                      // return interrupt setting
}

// #define USE_UART_SIGNALS_FOR_GPIO
#ifdef USE_UART_SIGNALS_FOR_GPIO
static inline void setDebug0(void)
{
    P3OUT |= TXD;
}
static inline void clearDebug0(void)
{
    P3OUT &= ~TXD;
}
static inline void setDebug1(void)
{
    P3OUT |= RXD;
}
static inline void clearDebug1(void)
{
    P3OUT &= ~RXD;
}
#endif

/*******************************************************************************
*  Polling Delays
*******************************************************************************/
void secDelay(uint8_t secCount);
void ms1Delay(uint8_t msCount);
void us10Delay(uint8_t us10);

/*******************************************************************************
* sysExec.c
*******************************************************************************/

typedef enum
{
    NORMAL_SYSTEM_OP,
    MANUF_TEST_WATER,
    MANUF_TEST_MODEM,
    MANUF_WATER_PASS,
    MANUF_MODEM_PASS,
    MANUF_TEST_GPS,
    MANUF_GPS_DONE,
    MANUF_UNIT_PASS
} MANUF_STATE_T;

/**
 * \typedef sysExecData_t
 * \brief Container to hold data for the sysExec module.
 */
typedef struct sysExecData_s {
    uint32_t total_flow;                                   /**< Number of milliliters of water poured in current session */
    uint16_t downspout_rate;                               /**< Maximum downspout rate setting for tuning accuracy based on board thickness */
    uint16_t dry_count;                                    /**< Current number of consecutive trends with no water */
    uint16_t dry_wake_time;                                /**< Number of consecutive trends with no water before sleeping */
    uint16_t margin_limit;                                 /**< Number of margin count difference between min and max for unit to be operational */
    bool FAMsgWasSent : 1;                                 /**< Flag specifying if Final Assembly msg was sent */
    bool mCheckInMsgWasSent : 1;                           /**< Flag specifying if Monthly Check In msg was sent */
    bool appRecordWasSet: 1;                               /**< Flag specifying if App record was set */
    bool sendTestMsgWasSent : 1;                           /**< Flag specifying if send_test msg was sent */
    bool sendTestRespWasSeen : 1;                          /**< Flag specifying if send_test response was seen */
    bool saveCapSensorBaselineData : 1;                    /**< Flag indicating that baseline cap sensor data must be stored */
    bool sendSensorDataMessage :1;                         /**< flag specifying if a sensor data report is requested */
    bool sendSensorDataNow: 1;                             /**< flag specifying that water data is immediately reported over Modem */
    bool faultWaterDetect: 1;                              /**< flag specifying that water water or unknowns are stuck  */
    bool sendTimeStamp: 1;                                 /**< flag specifying that the hourly time data needs to be sent */
    bool waterDetectStopped: 1;                            /**< flag specifying that water detection has been stopped */
    uint8_t waterDetectResets;                             /**< number of times the water detect algorithm data was cleared */
    uint8_t send_test_result;                              /**< result of sending the SEND_TEST message to the Modem */
    uint8_t led_on_time;                                   /**< number of iterations of the main loop that LED should remain on (2 sec resolution) */
    int8_t secondsTillStartUpMsgTx;                        /**< Seconds until startup messages are transmitted */
    int8_t secondsTillReboot;                              /**< How long to wait to perform a MSP430 reset */
    uint8_t rebootCountdownIsActive;                       /**< Specify if a reboot countdown sequence is in-progress */
    uint8_t noWaterMeasCount;                              /**< Maintain a count of sequential no water detected measurements */
    uint8_t waterMeasDelayCount;                           /**< Delay next water measurement count-down */
    uint8_t last_sleep_time;                               /**< Time that the unit slept during low power mode check */
    uint8_t sleep_count;                                   /**< The number of consecutive sleeps to make accuracy adjustment */
    uint8_t sleep_alot;                                    /**< The longer number of consecutive sleeps to make additional clock adjustment */
    MANUF_STATE_T mtest_state;                             /**< Manufacturing test State */
} sysExecData_t;


/**
 * \def REBOOT_KEY1
 * \def REBOOT_KEY2
 * \def REBOOT_KEY3
 * \def REBOOT_KEY4
 * \brief These keys are used to validate the OTA reset command.
 */
#define REBOOT_KEY1 ((uint8_t)0xAA)
#define REBOOT_KEY2 ((uint8_t)0x55)
#define REBOOT_KEY3 ((uint8_t)0xCC)
#define REBOOT_KEY4 ((uint8_t)0x33)

