charitywater/afridev2-sensor/software/firmware/AfridevV2_MSP430/src/outpour.h
void sysExec_exec(void);
bool sysExec_startRebootCountdown(uint8_t activateReboot);
void sysError(void);

// half second accuracy! 60 = 30 seconds; 3600 = 30 minutes
#ifdef WATER_DEBUG
#define SYSEXEC_NO_WATER_SLEEP_DELAY 60
#else
#ifndef DEBUG_BATTERY_TEST
#define SYSEXEC_NO_WATER_SLEEP_DELAY 3600
#else
#define SYSEXEC_NO_WATER_SLEEP_DELAY 60
#endif
#endif

#ifdef MARGIN_LIMIT_CHECKS
#define SYSEXEC_MARGIN_LIMIT 400
#else
#define SYSEXEC_MARGIN_LIMIT 65535
#endif

extern sysExecData_t sysExecData;

/*******************************************************************************
* Utils.c
*******************************************************************************/
typedef struct timeCompare_s {
    uint8_t hoursA;
    uint8_t minutesA;
    uint8_t secondsA;
    uint8_t hoursB;
    uint8_t minutesB;
    uint8_t secondsB;
    uint32_t timeDiffInSeconds;
} timeCompare_t;

unsigned int gen_crc16(const unsigned char *data, unsigned int size);
unsigned int gen_crc16_2buf(const unsigned char *data1, unsigned int size1, const unsigned char *data2, unsigned int size2);
uint32_t timeInSeconds(uint8_t hours, uint8_t minutes, uint8_t seconds);
void calcTimeDiffInSeconds(timeCompare_t *timeCompareP);
void reverseEndian32(uint32_t *valP);
void reverseEndian16(uint16_t *valP);

/*******************************************************************************
* modemCmd.h
*******************************************************************************/

/**
 * \typedef modemCmdWriteData_t 
 * \brief Container to pass parmaters to the modem command write 
 *        function.
 */
typedef struct modemCmdWriteData_s {
    outpour_modem_command_t cmd;                           /**< the modem command */
    MessageType_t payloadMsgId;                            /**< the payload type (Afridev message type) */
    uint8_t *payloadP;                                     /**< the payload pointer (if any) */
    uint16_t payloadLength;                                /**< size of the payload in bytes */
    uint16_t payloadOffset;                                /**< for receiving partial data */
    bool statusOnly;                                       /**< only perform status retrieve from modem - no cmd */
} modemCmdWriteData_t;

/**
 * \typedef modemCmdReadData_t 
 * \brief Container to read the raw response returned from the 
 *        modem as a result of sending it a command. 
 */
typedef struct modemCmdReadData_s {
    modem_command_t modemCmdId;                            /**< the cmd we are sending to the modem */
    bool valid;                                            /**< indicates that the response is correct (crc passed, etc) */
    uint8_t *dataP;                                        /**< the pointer to the raw buffer */
    uint16_t lengthInBytes;                                /**< the length of the data in the buffer */
} modemCmdReadData_t;

/**
 * \def OTA_PAYLOAD_MAX_READ_LENGTH
 * \brief Specify the max length of space allowed in the RX ISR
 *        Buffer for OTA message payload data. This length is in
 *        addition to the message header overhead which is read
 *        into the RX ISR buffer as well. Note that this max
 *        length only applies to the data portion received via
 *        the M_COMMAND_GET_INCOMING_PARTIAL command from the
 *        Modem. If the OTA data length is larger than the
 *        allowed max length, than an iterative approach is used
 *        to read the data from the modem in chunks. The only
 *        case where the iterative approach is needed is for a
 *        firmware upgrade.  All other OTA payload data length
 *        is currently less than 16 bytes.
 */
#define OTA_PAYLOAD_MAX_RX_READ_LENGTH ((uint16_t)512)

/**
 * \def OTA_RESPONSE_LENGTH
 * \brief Specify the total size of an OTA response.  This is 
 *        the length of an OTA response message being sent to
 *        the cloud by the unit. It is a constant value. It
 *        consists of the header and the data.  The header is
 *        always 16 bytes and the data is always 32 bytes -
 *        regardless of whether it is all used by the message
 *        sent.  Example OTA Response messages include
 *        OTA_OPCODE_GMT_CLOCKSET, OTA_OPCODE_LOCAL_OFFSET, etc.
 * \note An OTA Response should not be confused with a data 
 *       message (also sent to the cloud). Data messages are not
 *       a constant length.  Examples include
 *       MSG_TYPE_DAILY_LOG, MSG_TYPE_CHECKIN, etc.
 */
#define OTA_RESPONSE_LENGTH (OTA_RESPONSE_HEADER_LENGTH+OTA_RESPONSE_DATA_LENGTH)

/**
 * \def OTA_RESPONSE_HEADER_LENGTH
 * \brief Define the header length of an OTA response message 
 */
#define OTA_RESPONSE_HEADER_LENGTH ((uint8_t)16)

/**
 * \def OTA_RESPONSE_DATA_LENGTH
 * \brief Define the data length of an OTA response message. The
 *        data follows the header in the message.
 */
#define OTA_RESPONSE_DATA_LENGTH ((uint8_t)32)

/**
 * \typedef otaResponse_t
 * \brief Define a container to hold a partial OTA response.
 */
typedef struct otaResponse_s {
    uint8_t *buf;                                          /**< A buffer to hold one OTA message */
    uint16_t lengthInBytes;                                /**< how much valid data is in the buf */
    uint16_t remainingInBytes;                             /**< how much remaining of the total OTA */
}otaResponse_t;

/*******************************************************************************
* manufStore.c
*******************************************************************************/
/**
 * \typedef GPS_Data_t
 * \brief Define a container to hold GPS debug data messages
 */
typedef struct GPS_Data_s {
    uint8_t time[10];                                      /**< time reported by GPS module. Format:@xx:xx:xx  */ 
    uint8_t latitude[12];                                  /**< latitude reported by GPS module. Format: Nxx xx.xxx */
    uint8_t longitude[14];                                 /**< longitude reported by GPS module. Format: Wxxx xx.xxx */
    uint8_t fix_quality[4];                                /**< fix quality reported by GPS module. Format: q=x */
    uint8_t sat_count[5];                                  /**< satellite count reported by GPS module. Format: s=xx */
    uint8_t hdop_score[7];                                 /**< hdop score in meters reported by GPS module. Format: h=xx.x */
    uint8_t fix_is_valid[4];                               /**< fix is valid as determined by Afridev2 rules. Format: v=Y or N */
    uint8_t time_to_fix[8];                                /**< time to get GPS fix determined by Afridev2 code. Format: t=xxxxx */
    uint8_t zero;                                          /**< end of string, always zero */
} GPS_Data_t;

/**
 * \typedef Water_Data_t
 * \brief Define a container to hold Water detection debug data messages
 */
typedef struct Water_Data_s {
    uint8_t time[6];                                       /**< system time of data in seconds.*/ 
    uint8_t tempc[8];                                      /**< current pad temperature in tenths of degrees C.*/
    uint8_t pad0[9];                                       /**< current pad0 capacitance value OR current air deviation*/
    uint8_t pad1[9];                                       /**< current pad1 capacitance value OR current air deviation*/
    uint8_t pad2[9];                                       /**< current pad2 capacitance value OR current air deviation*/
    uint8_t pad3[9];                                       /**< current pad3 capacitance value OR current air deviation*/
    uint8_t pad4[9];                                       /**< current pad4 capacitance value OR current air deviation*/
    uint8_t pad5[9];                                       /**< current pad5 capacitance value OR current air deviation*/
    uint8_t level[2];                                      /**< current water level detected L1 to L6 */
    uint8_t flow[20];                                      /**< current water flow estimate for last 2 seconds in ml */
    uint8_t zero;                                          /**< end of string, always zero */
} Water_Data_t;

/**
 * \typedef Version_Data_t
 * \brief Define a container to hold software release information
 */
typedef struct Version_Data_s {
    uint8_t prefix;                                        /**< character that identifies this message */
    uint8_t release[12];                                   /**< name of firmware release */
    uint8_t version[12];                                   /**< version of firmware release */
    uint8_t date[12];                                      /**< date of firmware release */
    uint8_t zero;                                          /**< end of string, always zero */
} Version_Data_t;

