charitywater/afridev2-sensor/software/firmware/AfridevV2_MSP430/src/outpour.h
extern Water_Data_t water_report;
extern GPS_Data_t gps_report;

#ifdef WATER_DEBUG
extern bool mTestGPSDone(void);
extern bool mTestWaterDone(void);
#endif
extern bool mTestBaselineDone(void);

void modemCmd_exec(void);
void modemCmd_init(void);
bool modemCmd_write(modemCmdWriteData_t *writeCmdP);
void modemCmd_read(modemCmdReadData_t *readDataP);
bool modemCmd_isResponseReady(void);
bool modemCmd_isError(void);
bool modemCmd_isBusy(void);
void modemCmd_isr(void);

/*******************************************************************************
* modemPower.c
*******************************************************************************/
void modemPower_exec(void);
void modemPower_init(void);
void modemPower_restart(void);
void modemPower_powerDownModem(void);
bool modemPower_isModemOn(void);
uint16_t modemPower_getModemOnTimeInSecs(void);
bool modemPower_isModemOnError(void);

/*******************************************************************************
* modemMgr.c
*******************************************************************************/

/**
 * \def SHARED_BUFFER_SIZE
 * The OTA payload buffer is shared for other things that need a
 * buffer when the modem OTA processing is not active.  
 */
#define SHARED_BUFFER_SIZE OTA_PAYLOAD_MAX_RX_READ_LENGTH

// wait up to 5 minutes for a SEND_TEST "Success"
#define SEND_TEST_RETRIES 150
#define SYSEXEC_SEND_TEST_IDLE 0
#define SYSEXEC_SEND_TEST_RUNNING 1
#define SYSEXEC_SEND_TEST_PASS 2
#define SYSEXEC_SEND_TEST_FAIL 0xFF

void sysExec_set_send_test_result(uint8_t result);

/**
 * \typedef msgHeader_t
 * \brief Define the structure of the header that sits on top of
 *        of all outbound messages.
 */
typedef struct __attribute__((__packed__))msgHeader_s {
    uint8_t payloadStartByte;                              /**< 0 */
    uint8_t payloadMsgId;                                  /**< 1 */
    uint8_t productId;                                     /**< 2 */
    uint8_t GMTsecond;                                     /**< 3 */
    uint8_t GMTminute;                                     /**< 4 */
    uint8_t GMThour;                                       /**< 5 */
    uint8_t GMTday;                                        /**< 6 */
    uint8_t GMTmonth;                                      /**< 7 */
    uint8_t GMTyear;                                       /**< 8 */
    uint8_t fwMajor;                                       /**< 9 */
    uint8_t fwMinor;                                       /**< 10 */
    uint8_t daysActivatedMsb;                              /**< 11 */
    uint8_t daysActivatedLsb;                              /**< 12 */
    uint8_t storageWeek;                                   /**< 14 */
    uint8_t storageDay;                                    /**< 13 */
    uint8_t reserve1;                                      /**< 15 */
} msgHeader_t;


/**
 * \typedef mwBatchState_t
 * \brief Define the states that make up the modem write batch
 *        job states.
 */
typedef enum mwBatchState_e {
    MWBATCH_STATE_IDLE,
    MWBATCH_STATE_PING,
    MWBATCH_STATE_PING_WAIT,
    MWBATCH_STATE_WRITE_CMD,
    MWBATCH_STATE_WRITE_CMD_WAIT,
    MWBATCH_STATE_MODEM_STATUS,
    MWBATCH_STATE_MODEM_STATUS_WAIT,
    MWBATCH_STATE_MSG_STATUS,
    MWBATCH_STATE_MSG_STATUS_WAIT,
    MWBATCH_STATE_DONE,
}mwBatchState_t;

/**
 * \typedef mwState_t
 * \brief Define the states that make up the modem shutdown
 *        states.
 */
typedef enum mmShutdownState_e {
    M_SHUTDOWN_STATE_IDLE,
    M_SHUTDOWN_STATE_WRITE_CMD,
    M_SHUTDOWN_STATE_WRITE_CMD_WAIT,
    M_SHUTDOWN_STATE_WAIT,
    M_SHUTDOWN_STATE_DONE,
}mmShutdownState_t;

/**
 * \typedef mwBatchData_t
 * \brief Define a container to hold data specific to the modem
 *        write batch job.
 */
typedef struct mwBatchData_s {
    bool allocated;                                        /**< flag to indicate modem is owned by client */
    bool batchWriteActive;                                 /**< currently sending out a write batch job */
    bool commError;                                        /**< A modem UART comm error occurred during the job */
    uint8_t sendTestActive;                                /**< A flag for a special handling of "transmission in progress" */
    uint8_t modemNetworkStatus;                            /**< network connection status received from modem */
    mwBatchState_t mwBatchState;                           /**< current batch job state */
    modemCmdWriteData_t *cmdWriteP;                        /**< A pointer to the command info object provided by user */
    otaResponse_t otaResponse;                             /**< payload of the last ota message received */
    uint8_t numOfOtaMsgsAvailable;                         /**< parsed from modem message status command */
    uint16_t sizeOfOtaMsgsAvailable;                       /**< parsed from modem message status command */
    bool shutdownActive;                                   /**< currently performing a modem shutdown */
    mmShutdownState_t mmShutdownState;                     /**< current shutdown state */
    sys_tick_t shutdownTimestamp;                          /**< for determing time delay for modem power down */
} mwBatchData_t;

extern mwBatchData_t mwBatchData;

void modemMgr_exec(void);
void modemMgr_init(void);
bool modemMgr_grab(void);
bool modemMgr_isModemUp(void);
bool modemMgr_isModemUpError(void);
void modemMgr_sendModemCmdBatch(modemCmdWriteData_t *cmdWriteP);
void modemMgr_stopModemCmdBatch(void);
bool modemMgr_isModemCmdComplete(void);
bool modemMgr_isModemCmdError(void);
void modemMgrRelease(void);
void modemMgr_restartModem(void);
bool modemMgr_isAllocated(void);
void modemMgr_release(void);
bool modemMgr_isReleaseComplete(void);
otaResponse_t* modemMgr_getLastOtaResponse(void);
bool modemMgr_isLinkUp(void);
bool modemMgr_isLinkUpError(void);
uint8_t modemMgr_getNumOtaMsgsPending(void);
uint16_t modemMgr_getSizeOfOtaMsgsPending(void);
uint8_t* modemMgr_getSharedBuffer(void);

