charitywater/afridev2-sensor/software/firmware/AfridevV2_MSP430/src/outpour.h
/*******************************************************************************
* msgData.c
*******************************************************************************/
void dataMsgMgr_exec(void);
void dataMsgMgr_init(void);
bool dataMsgMgr_isSendMsgActive(void);
bool dataMsgMgr_sendDataMsg(MessageType_t msgId, uint8_t *dataP, uint16_t lengthInBytes);
bool dataMsgMgr_sendTestMsg(MessageType_t msgId, uint8_t *dataP, uint16_t lengthInBytes);
bool dataMsgMgr_startSendingScheduled(void);
bool dataMsgMgr_sendTestMsg_Passed(void);

/*******************************************************************************
* msgOta.c
*******************************************************************************/
void otaMsgMgr_exec(void);
void otaMsgMgr_init(void);
void otaMsgMgr_getAndProcessOtaMsgs(void);
void otaMsgMgr_stopOtaProcessing(void);
bool otaMsgMgr_isOtaProcessingDone(void);

#define SENSOR_REQ_SENSOR_DATA 0
#define SENSOR_OVERWRITE_FACTORY 1
#define SENSOR_RESET_WATER_DETECT 2
#define SENSOR_SET_UNKNOWN_LIMIT 3
#define SENSOR_REPORT_NOW 4
#define SENSOR_DOWNSPOUT_RATE 5
#define SENSOR_SET_WATER_LIMIT 6
#define SENSOR_SET_WAKE_TIME 7
#define SENSOR_NOP_RESPONSE 8
#define SENSOR_MARGIN_GROW 9

/*******************************************************************************
* msgOtaUpgrade.c
*******************************************************************************/

/**
 * \typedef fwUpdateResult_t
 * \brief Specify the different status results that the firmware
 *        update state machine can exit in.
 */
typedef enum fwUpdateResult_e {
    RESULT_NO_FWUPGRADE_PERFORMED = 0,
    RESULT_DONE_SUCCESS = 1,
    RESULT_DONE_ERROR = -1,
} fwUpdateResult_t;

fwUpdateResult_t otaUpgrade_processOtaUpgradeMessage(void);
fwUpdateResult_t otaUpgrade_getFwUpdateResult(void);
uint16_t otaUpgrade_getFwMessageCrc(void);
uint16_t otaUpgrade_getFwCalculatedCrc(void);
uint16_t otaUpgrade_getFwLength(void);
uint8_t otaUpgrade_getErrorCode(void);

/*******************************************************************************
* msgDebug.c
*******************************************************************************/

void dbgMsgMgr_sendDebugMsg(MessageType_t msgId, uint8_t *dataP, uint16_t lengthInBytes);

/*******************************************************************************
* msgData.c
*******************************************************************************/
/**
 * \typedef dataMsgState_t
 * \brief Specify the states for sending a data msg to the 
 *        modem.
 */
typedef enum dataMsgState_e {
    DMSG_STATE_IDLE,
    DMSG_STATE_GRAB,
    DMSG_STATE_WAIT_FOR_MODEM_UP,
    DMSG_STATE_SEND_MSG,
    DMSG_STATE_SEND_MSG_WAIT,
    DMSG_STATE_WAIT_FOR_LINK,
    DMSG_STATE_PROCESS_OTA,
    DMSG_STATE_PROCESS_OTA_WAIT,
    DMSG_STATE_RELEASE,
    DMSG_STATE_RELEASE_WAIT,
} dataMsgState_t;

/**
 * \typedef dataMsgSm_t
 * \brief Define a contiainer to hold the information needed by 
 *        the data message module to perform sending a data
 *        command to the modem.
 *  
 * \note To save memory, this object can potentially be a common
 *       object that all clients use because only one client
 *       will be using the modem at a time?
 */
typedef struct dataMsgSm_s {
    dataMsgState_t dataMsgState;                           /**< current data message state */
    modemCmdWriteData_t cmdWrite;                          /**< the command info object */
    uint8_t modemResetCount;                               /**< for error recovery, count times modem is power cycled */
    bool sendCmdDone;                                      /**< flag to indicate sending the current command to modem is complete */
    bool allDone;                                          /**< flag to indicate send session is complete and modem is off */
    bool connectTimeout;                                   /**< flag to indicate the modem was not able to connect to the network */
    bool commError;                                        /**< flag to indicate an modem UART comm error occured - not currently used - can remove */
} dataMsgSm_t;

void dataMsgSm_init(void);
void dataMsgSm_initForNewSession(dataMsgSm_t *dataMsgP);
void dataMsgSm_sendAnotherDataMsg(dataMsgSm_t *dataMsgP);
void dataMsgSm_stateMachine(dataMsgSm_t *dataMsgP);

/*******************************************************************************
* time.c
*******************************************************************************/
/**
 * \typedef timePacket_t 
 * \brief Specify a structure to hold time data that will be 
 *        sent as part of the final assembly message.
 */
typedef struct __attribute__((__packed__))timePacket_s {
    uint8_t second;
    uint8_t minute;
    uint8_t hour24;
    uint8_t day;
    uint8_t month;
    uint8_t year;
} timePacket_t;

void timerA0_init(void);
void all_timers_adjust_time(uint8_t adjustment);
void getBinTime(timePacket_t *tpP);
uint8_t bcd_to_char(uint8_t bcdValue);
uint32_t getSecondsSinceBoot(void);

// Watchdog Macros
// 1 second time out, uses ACLK
#define WATCHDOG_TICKLE() (WDTCTL = WDT_ARST_1000)
#define WATCHDOG_STOP() (WDTCTL = (WDTPW | WDTHOLD))

// For testing, don't enable watchdog
// #define WATCHDOG_TICKLE() (WDTCTL = WDTPW | WDTHOLD)

void timerA0_inter_sample_sleep(void);
void timerA0_20sec_sleep(void);
uint16_t time_util_RTC_hms(timePacket_t *tp);

/*******************************************************************************
* manufStore.c
*******************************************************************************/

/**
 * \typedef MDR_type_e
 * \brief Define the sections of the Manufacturing data
 */
typedef enum
{
    MDR_Water_Record,
    MDR_GPS_Record,
    MDR_Modem_Record
} MDR_type_e;

#define MDR_NUMPADS 6
 
/**
 * \typedef MDRwaterRecord_t
 * \brief Water Detect Manufacturing test data (26 bytes)
 */
typedef struct __attribute__((__packed__)){
        uint16_t padBaseline[MDR_NUMPADS];                 /**< Pad Baseline Capacitance values for a DRY board */
        uint16_t airDeviation[MDR_NUMPADS];                /**< Air Deviation values for first water measurement  */
        int16_t padTemp;                                   /**< Temperature of pads at padBaseline */
} MDRwaterRecord_t;

#define MDR_GPS_LAT_LEN 11
#define MDR_GPS_LON_LEN 12

/**
 * \typedef MDRgpsRecord_t
 * \brief GPS Manufacturing test data (30 bytes)
 */
typedef struct __attribute__((__packed__))mdr_gps_s {
    uint16_t gpsTime;                                      /**< Time of GPS Test Fix */
    uint16_t gpsHdop;                                      /**< HDOP metric of GPS Test Fix */
    uint8_t gpsQuality;                                    /**< Quality of GPS Test Fix */
    uint8_t gpsSatellites;                                 /**< Numbr of Sattelites Quality with GPS Test Fix */
    uint8_t gpsLatitude[MDR_GPS_LAT_LEN];                  /**< Latitiude of GPS Test Fix */
    uint8_t zero;                                          /**< word alignment padding */
    uint8_t gpsLongitude[MDR_GPS_LON_LEN];                 /**< Longitude of GPS Test Fix */
} MDRgpsRecord_t;

/**
 * \typedef MDRmodemRecord_t
 * \brief Modem Manufacturing test data (2 bytes)
 */
typedef struct __attribute__((__packed__))mdr_modem_s {
    uint8_t send_test;                                     /**< Count of number of times SEND_TEST message was sent */
    uint8_t future_use;
} MDRmodemRecord_t;

extern bool manufRecord_manuf_test_init(void);
extern void manufRecord_manuf_test_result(void);
extern bool waterDetect_restore_pads_baseline(MDRwaterRecord_t *wr);

/**
 * \typedef manufRecord_t
 * \brief This structure is used to store the results of Manufacturing testing in the factory
 *
 */
typedef struct __attribute__((__packed__))manufRecord_s {
    uint16_t magic;                                        /**< A known pattern for "quick" test of structure validity */
    uint16_t recordLength;                                 /**< Length of structure */
    MDRwaterRecord_t wr;                                   /**< Water detect test data, 26 bytes */
    MDRgpsRecord_t gr;                                     /**< GPS test data, 30 bytes */
    MDRmodemRecord_t mr;                                   /**< modem test data, 2 bytes */
    uint16_t crc16;                                        /**< crc16 Used to validate the data */
} manufRecord_t;

uint16_t gps_getGpsMessage(uint8_t **payloadPP);
bool manufRecord_updateManufRecord(MDR_type_e mr_type, uint8_t *mr_in, uint8_t len_in);
void manufRecord_getWaterInfo(MDRwaterRecord_t *wr_in);
bool manufRecord_checkForValidManufRecord(void);
bool manufRecord_initBootloaderRecord(void);
bool manufRecord_setBaselineAirTargets(void);
bool manufRecord_send_test(void);
void manufRecord_update_LEDs(void);
uint16_t manufRecord_getSensorDataMessage(uint8_t **payloadPP);

