charitywater/afridev2-sensor/software/firmware/AfridevV2_MSP430/src/outpour.h
/*******************************************************************************
* storage.c
*******************************************************************************/

/**
 * \typedef storageData_t
 * \brief Define a container to hold data for the storage
 *        module.
 */
typedef struct storageData_s {
    uint16_t daysActivated;                                /**< Total days unit has been activated */
    uint16_t minuteMilliliterSum;                          /**< Running milliliter sum for current minute */
    uint32_t hourMilliliterSum;                            /**< Running milliliter sum for current hour */
    uint32_t dayMilliliterSum;                             /**< Running milliliter sum for current day */
    uint16_t activatedLiterSum;                            /**< Save the liter sum when activated */

    uint8_t storageTime_seconds;                           /**< Current storage time - sec  */
    uint8_t storageTime_minutes;                           /**< Current storage time - min */
    uint8_t storageTime_hours;                             /**< Current storage time - hour */
    uint8_t storageTime_dayOfWeek;                         /**< Current storage time - day */
    uint8_t storageTime_week;                              /**< Current storage time - week */
    uint8_t curWeeklyLogNum;                               /**< Current weekly flash log number we are storing to */

    bool alignStorageFlag;                                 /**< True if time to align storage time */
    uint8_t alignSecond;                                   /**< Time to align at - sec */
    uint8_t alignMinute;                                   /**< Time to align at - min */
    uint8_t alignHour24;                                   /**< Time to align at - hour */
    int32_t alignSafetyCheckInSec;                         /**< Max time to wait for an align event */

    bool redFlagCondition;                                 /**< flag for red flag condition */
    uint8_t redFlagDayCount;                               /**< running count of red flag days */
    uint8_t redFlagMapDay;                                 /**< used as index for red flag init mapping */
    bool redFlagDataFullyPopulated;                        /**< true if redflag init mapping is completed */
    uint16_t redFlagThreshTable[7];                        /**< store redFlag compare thresholds */

    uint8_t transmissionRateInDays;                        /**< Specify how often to transmit data */
    int8_t daysSinceLastTransmission;                      /**< Track number of days since last transmission */
    bool sendData;                                         /**< True if ready to send water log data */
    uint8_t startTxWeek;                                   /**< What week's log to start transmitting from */
    uint8_t curTxWeek;                                     /**< What week's log we are currently transmitting */
    uint8_t totalDailyLogsTransmitted;                     /**< Counter of total daily logs transmitted in current tx session */
    bool haveSentDailyLogs;                                /**< Flag to indicate we have transmitted a daily log */

} storageData_t;

#ifdef SEND_DEBUG_TIME_DATA
// this is the definition of the timestamp message payload
typedef struct
{
    uint8_t ph[16];
    uint32_t sys_time;  // 4 bytes
    timePacket_t tp;    // 6 bytes
    uint8_t storageTime_seconds;
    uint8_t storageTime_minutes;
    uint8_t storageTime_hours;
    uint8_t unused;
} storageTimeStamp_T;
#endif

void storageMgr_init(void);
void storageMgr_exec(uint16_t currentFlowRateInSecML, uint8_t time_elapsed);
void storageMgr_overrideUnitActivation(bool flag);
uint16_t storageMgr_getDaysActivated(void);
void storageMgr_resetRedFlag(void);
bool storageMgr_getRedFlagConditionStatus(void);
void storageMgr_resetRedFlagAndMap(void);
void storageMgr_resetWeeklyLogs(void);
void storageMgr_setStorageAlignmentTime(uint8_t alignSecond, uint8_t alignMinute, uint8_t alignHour24);
void storageMgr_setTransmissionRate(uint8_t transmissionRateInDays);
uint16_t storageMgr_getNextDailyLogToTransmit(uint8_t **dataPP);
void storageMgr_sendDebugDataToUart(void);
uint8_t storageMgr_getStorageClockInfo(uint8_t *bufP);
uint8_t storageMgr_getStorageClockHour(void);
uint8_t storageMgr_getStorageClockMinute(void);
uint8_t storageMgr_prepareMsgHeader(uint8_t *dataPtr, uint8_t payloadMsgId);
uint16_t storageMgr_getMonthlyCheckinMessage(uint8_t **payloadPP);
uint16_t storageMgr_getActivatedMessage(uint8_t **payloadPP);
#ifdef SEND_DEBUG_TIME_DATA
uint16_t storageMgr_getTimestampMessage(uint8_t **payloadPP);
#endif

#ifdef DEBUG_DAILY_WATER_REPORTS
#define STORAGE_TRANSMISSION_RATE_DEFAULT 1
#else
#define STORAGE_TRANSMISSION_RATE_DEFAULT 7
#endif

extern storageData_t stData;

/*******************************************************************************
* waterSense.c
*******************************************************************************/
void waterSense_init(void);
void waterSense_exec(void);
bool waterSense_isInstalled(void);
uint16_t waterSense_getLastMeasFlowRateInML(void);
void waterSense_clearStats(void);
uint16_t waterSense_getPadStatsMax(padId_t padId);
uint16_t waterSense_padStatsMin(padId_t padId);
uint16_t waterSense_getPadStatsSubmerged(padId_t padId);
uint16_t waterSense_getPadStatsUnknowns(void);
uint16_t padStats_zeros(void);
int16_t waterSense_getTempCelcius(void);
void waterSense_writeConstants(uint8_t *dataP);
void waterSense_sendDebugDataToUart(void);

/*******************************************************************************
* CTS_HAL.c
*******************************************************************************/
extern uint8_t CAPSENSE_ACTIVE;

/*******************************************************************************
* hal.c
*******************************************************************************/
void hal_sysClockInit(void);
void hal_uartInit(void);
void hal_pinInit(void);
void hal_led_toggle(void);
void hal_led_blink_red(void);
void hal_led_green(void);
void hal_led_red(void);
void hal_led_none(void);
void hal_led_both(void);
void hal_low_power_enter(void);

