charitywater/afridev2-sensor/software/firmware/AfridevV2_MSP430/src/outpour.h
/*******************************************************************************
* flash.c
*******************************************************************************/
void msp430Flash_erase_segment(uint8_t *flashSectorAddrP);
void msp430Flash_write_bytes(uint8_t *flashP, uint8_t *srcP, uint16_t num_bytes);
void msp430Flash_write_int16(uint8_t *flashP, uint16_t val16);
void msp430Flash_write_int32(uint8_t *flashP, uint32_t val32);

/*******************************************************************************
* For Firmware Upgrade Support
*******************************************************************************/
/**
 * \def FLASH_UPGRADE_KEY1
 * \def FLASH_UPGRADE_KEY2
 * \def FLASH_UPGRADE_KEY3
 * \def FLASH_UPGRADE_KEY4
 * \brief These keys are used to validate the OTA firmware
 *        upgrade command.
 */
#define FLASH_UPGRADE_KEY1 ((uint8_t)0x31)
#define FLASH_UPGRADE_KEY2 ((uint8_t)0x41)
#define FLASH_UPGRADE_KEY3 ((uint8_t)0x59)
#define FLASH_UPGRADE_KEY4 ((uint8_t)0x26)

/*******************************************************************************
* appRecord.c
*******************************************************************************/
bool appRecord_initAppRecord(void);
bool appRecord_checkForValidAppRecord(void);
bool appRecord_checkForNewFirmware(void);
bool appRecord_updateFwInfo(bool newFwIsReady, uint16_t newFwCrc);
bool appRecord_getNewFirmwareInfo(bool *newFwReadyP, uint16_t *newFwCrcP);
void appRecord_erase(void);
#if 0
void appRecord_test(void);
#endif

/*******************************************************************************
* MsgSchedule.c 
*******************************************************************************/
void msgSched_init(void);
void msgSched_exec(void);
void msgSched_scheduleDailyWaterLogMessage(void);
void msgSched_scheduleActivatedMessage(void);
void msgSched_scheduleMonthlyCheckInMessage(void);
void msgSched_scheduleGpsLocationMessage(void);
void msgSched_scheduleGpsMeasurement(void);
void msgSched_scheduleSensorDataMessage(void);
#ifdef SEND_DEBUG_TIME_DATA
void msgSched_scheduleTimeStampMessage(void);
#endif
void msgSched_getNextMessageToTransmit(modemCmdWriteData_t *cmdWriteP);

/*******************************************************************************
* gps.c 
*******************************************************************************/
void gps_init(void);
void gps_exec(void);
void gps_start(void);
void gps_stop(void);
bool gps_isActive(void);
uint16_t gps_getGpsMessage(uint8_t **payloadP);
uint16_t gps_getGpsData(uint8_t *bufP);

/**
 * \typedef gpsState_t
 * \brief Define the different states to manage on the GPS.
 */
typedef enum {
    GPS_STATE_IDLE,
    GPS_STATE_POWER_UP,
    GPS_STATE_POWER_UP_WAIT,
    GPS_STATE_MSG_RX_START,
    GPS_STATE_MSG_RX_WAIT,
    GPS_STATE_RETRY,
    GPS_STATE_DONE,
} gpsState_t;

/**
 * \typedef gpsData_t
 * \brief Data used to track the progress of GPS data acquisition
 */
typedef struct gpsData_s {
    bool active;
    gpsState_t state;
    uint8_t gpsOnRetryCount;
    uint8_t retryCount;
    sys_tick_t startGpsTimestamp;
} gpsData_t;

extern gpsData_t gpsData;

#ifdef GPS_DEBUG
void gps_record_last_fix(void);
#endif

/*******************************************************************************
* gpsPower.c 
*******************************************************************************/
void gpsPower_exec(void);
void gpsPower_init(void);
void gpsPower_restart(void);
void gpsPower_powerDownGPS(void);
bool gpsPower_isGpsOn(void);
bool gpsPower_isGpsOnError(void);
uint16_t gpsPower_getGpsOnTimeInSecs(void);

/*******************************************************************************
* gpsMsg.c 
*******************************************************************************/

typedef struct __attribute__((__packed__))gpsReportData_s {
    uint8_t hours;
    uint8_t minutes;
    int32_t latitude;
    int32_t longitude;
    uint8_t fixQuality;
    uint8_t numOfSats;
    uint8_t hdop;
    uint8_t reserved;
    uint16_t fixTimeInSecs;
}gpsReportData_t;

void gpsMsg_init(void);
void gpsMsg_exec(void);
bool gpsMsg_start(void);
void gpsMsg_stop(void);
bool gpsMsg_isActive(void);
bool gpsMsg_isError(void);
bool gpsMsg_gotGgaMessage(void);
bool gpsMsg_gotValidGpsFix(void);
void gpsMsg_isr(void);
uint8_t gpsMsg_getGgaParsedData(uint8_t *bufP);
void gpsMsg_setMeasCriteria(uint8_t numSats, uint8_t hdop, uint16_t minMeasTime);
void gps_record_last_fix(void);

